bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/MEGA/ATMEGA324P.xml
<?xml version="1.0" encoding="UTF-8"?>
<target-description-file>
    <variants>
        <variant ordercode="ATmega324PV-10AU" tempmin="-40" tempmax="85" speedmax="10000000" pinout="TQFP_VQFN_44"
                 package="TQFP44" vccmin="1.8" vccmax="5.5"/>
        <variant ordercode="ATmega324PV-10PU" tempmin="-40" tempmax="85" speedmax="10000000" pinout="PDIP40"
                 package="PDIP40" vccmin="1.8" vccmax="5.5"/>
        <variant ordercode="ATmega324PV-10MU" tempmin="-40" tempmax="85" speedmax="10000000" pinout="TQFP_VQFN_44"
                 package="VQFN44" vccmin="1.8" vccmax="5.5"/>
        <variant ordercode="ATmega324P-20AU" tempmin="-40" tempmax="85" speedmax="20000000" pinout="TQFP_VQFN_44"
                 package="TQFP44" vccmin="2.7" vccmax="5.5"/>
        <variant ordercode="ATmega324P-20PU" tempmin="-40" tempmax="85" speedmax="20000000" pinout="PDIP40"
                 package="PDIP40" vccmin="2.7" vccmax="5.5"/>
        <variant ordercode="ATmega324P-20MU" tempmin="-40" tempmax="85" speedmax="20000000" pinout="TQFP_VQFN_44"
                 package="VQFN44" vccmin="2.7" vccmax="5.5"/>
        <variant ordercode="ATmega324PV-10AN" tempmin="-40" tempmax="105" speedmax="10000000" pinout="TQFP_VQFN_44"
                 package="TQFP44" vccmin="1.8" vccmax="5.5"/>
        <variant ordercode="ATmega324PV-10PN" tempmin="-40" tempmax="105" speedmax="10000000" pinout="PDIP40"
                 package="PDIP40" vccmin="1.8" vccmax="5.5"/>
        <variant ordercode="ATmega324PV-10MN" tempmin="-40" tempmax="105" speedmax="10000000" pinout="TQFP_VQFN_44"
                 package="VQFN44" vccmin="1.8" vccmax="5.5"/>
        <variant ordercode="ATmega324P-20AN" tempmin="-40" tempmax="105" speedmax="20000000" pinout="TQFP_VQFN_44"
                 package="TQFP44" vccmin="2.7" vccmax="5.5"/>
        <variant ordercode="ATmega324P-20PN" tempmin="-40" tempmax="105" speedmax="20000000" pinout="PDIP40"
                 package="PDIP40" vccmin="2.7" vccmax="5.5"/>
        <variant ordercode="ATmega324P-20MN" tempmin="-40" tempmax="105" speedmax="20000000" pinout="TQFP_VQFN_44"
                 package="VQFN44" vccmin="2.7" vccmax="5.5"/>
    </variants>
    <devices>
        <device name="ATmega324P" architecture="AVR8" family="megaAVR">
            <address-spaces>
                <address-space endianness="little" name="prog" id="prog" start="0x0000" size="0x8000">
                    <memory-segment start="0x0000" size="0x8000" type="flash" rw="RW" exec="1" name="FLASH"
                                    pagesize="0x80"/>
                    <memory-segment start="0x7e00" size="0x0200" type="flash" rw="RW" exec="1" name="BOOT_SECTION_1"
                                    pagesize="0x80"/>
                    <memory-segment start="0x7c00" size="0x0400" type="flash" rw="RW" exec="1" name="BOOT_SECTION_2"
                                    pagesize="0x80"/>
                    <memory-segment start="0x7800" size="0x0800" type="flash" rw="RW" exec="1" name="BOOT_SECTION_3"
                                    pagesize="0x80"/>
                    <memory-segment start="0x7000" size="0x1000" type="flash" rw="RW" exec="1" name="BOOT_SECTION_4"
                                    pagesize="0x80"/>
                </address-space>
                <address-space endianness="little" name="signatures" id="signatures" start="0" size="3">
                    <memory-segment start="0" size="3" type="signatures" rw="R" exec="0" name="SIGNATURES"/>
                </address-space>
                <address-space endianness="little" name="fuses" id="fuses" start="0" size="0x0003">
                    <memory-segment start="0" size="0x0003" type="fuses" rw="RW" exec="0" name="FUSES"/>
                </address-space>
                <address-space endianness="little" name="lockbits" id="lockbits" start="0" size="0x0001">
                    <memory-segment start="0" size="0x0001" type="lockbits" rw="RW" exec="0" name="LOCKBITS"/>
                </address-space>
                <address-space endianness="little" name="data" id="data" start="0x0000" size="0x0900">
                    <memory-segment external="false" type="regs" size="0x0020" start="0x0000" name="REGISTERS"/>
                    <memory-segment name="MAPPED_IO" start="0x0020" size="0x00e0" type="io" external="false"/>
                    <memory-segment name="IRAM" start="0x0100" size="0x0800" type="ram" external="false"/>
                </address-space>
                <address-space endianness="little" name="eeprom" id="eeprom" start="0x0000" size="0x0400">
                    <memory-segment start="0x0000" size="0x0400" type="eeprom" rw="RW" exec="0" name="EEPROM"
                                    pagesize="0x04"/>
                </address-space>
                <address-space size="0x40" start="0x00" endianness="little" name="io" id="io"/>
                <address-space endianness="little" name="osccal" id="osccal" start="0" size="1">
                    <memory-segment start="0" size="1" type="osccal" rw="R" exec="0" name="OSCCAL"/>
                </address-space>
            </address-spaces>
            <peripherals>
                <module name="AC">
                    <instance name="AC" caption="Analog Comparator">
                        <register-group name="AC" name-in-module="AC" offset="0x00" address-space="data"
                                        caption="Analog Comparator"/>
                        <signals>
                            <signal group="AIN" index="0" function="default" pad="PB2"/>
                            <signal group="AIN" index="1" function="default" pad="PB3"/>
                        </signals>
                    </instance>
                </module>
                <module name="USART">
                    <instance name="USART0" caption="USART">
                        <register-group name="USART0" name-in-module="USART0" offset="0x00" address-space="data"
                                        caption="USART"/>
                        <signals>
                            <signal group="TXD" function="default" pad="PD1"/>
                            <signal group="RXD" function="default" pad="PD0"/>
                            <signal group="XCK" function="default" pad="PB0"/>
                        </signals>
                    </instance>
                    <instance name="USART1" caption="USART">
                        <register-group name="USART1" name-in-module="USART1" offset="0x00" address-space="data"
                                        caption="USART"/>
                        <signals>
                            <signal group="TXD" function="default" pad="PD3"/>
                            <signal group="RXD" function="default" pad="PD2"/>
                            <signal group="XCK" function="default" pad="PD4"/>
                        </signals>
                    </instance>
                </module>
                <module name="PORT">
                    <instance name="PORTA" caption="I/O Port">
                        <register-group name="PORTA" name-in-module="PORTA" offset="0x00" address-space="data"
                                        caption="I/O Port"/>
                        <signals>
                            <signal group="P" function="default" pad="PA0" index="0"/>
                            <signal group="P" function="default" pad="PA1" index="1"/>
                            <signal group="P" function="default" pad="PA2" index="2"/>
                            <signal group="P" function="default" pad="PA3" index="3"/>
                            <signal group="P" function="default" pad="PA4" index="4"/>
                            <signal group="P" function="default" pad="PA5" index="5"/>
                            <signal group="P" function="default" pad="PA6" index="6"/>
                            <signal group="P" function="default" pad="PA7" index="7"/>
                        </signals>
                    </instance>
                    <instance name="PORTB" caption="I/O Port">
                        <register-group name="PORTB" name-in-module="PORTB" offset="0x00" address-space="data"
                                        caption="I/O Port"/>
                        <signals>
                            <signal group="P" function="default" pad="PB0" index="0"/>
                            <signal group="P" function="default" pad="PB1" index="1"/>
                            <signal group="P" function="default" pad="PB2" index="2"/>
                            <signal group="P" function="default" pad="PB3" index="3"/>
                            <signal group="P" function="default" pad="PB4" index="4"/>
                            <signal group="P" function="default" pad="PB5" index="5"/>
                            <signal group="P" function="default" pad="PB6" index="6"/>
                            <signal group="P" function="default" pad="PB7" index="7"/>
                        </signals>
                    </instance>
                    <instance name="PORTC" caption="I/O Port">
                        <register-group name="PORTC" name-in-module="PORTC" offset="0x00" address-space="data"
                                        caption="I/O Port"/>
                        <signals>
                            <signal group="P" function="default" pad="PC0" index="0"/>
                            <signal group="P" function="default" pad="PC1" index="1"/>
                            <signal group="P" function="default" pad="PC2" index="2"/>
                            <signal group="P" function="default" pad="PC3" index="3"/>
                            <signal group="P" function="default" pad="PC4" index="4"/>
                            <signal group="P" function="default" pad="PC5" index="5"/>
                            <signal group="P" function="default" pad="PC6" index="6"/>
                            <signal group="P" function="default" pad="PC7" index="7"/>
                        </signals>
                    </instance>
                    <instance name="PORTD" caption="I/O Port">
                        <register-group name="PORTD" name-in-module="PORTD" offset="0x00" address-space="data"
                                        caption="I/O Port"/>
                        <signals>
                            <signal group="P" function="default" pad="PD0" index="0"/>
                            <signal group="P" function="default" pad="PD1" index="1"/>
                            <signal group="P" function="default" pad="PD2" index="2"/>
                            <signal group="P" function="default" pad="PD3" index="3"/>
                            <signal group="P" function="default" pad="PD4" index="4"/>
                            <signal group="P" function="default" pad="PD5" index="5"/>
                            <signal group="P" function="default" pad="PD6" index="6"/>
                            <signal group="P" function="default" pad="PD7" index="7"/>
                        </signals>
                    </instance>
                </module>
