bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/MEGA/ATMEGA324P.xml
        <module caption="Serial Peripheral Interface" name="SPI">
            <register-group caption="Serial Peripheral Interface" name="SPI">
                <register caption="SPI Data Register" name="SPDR0" offset="0x4E" size="1" mask="0xFF" ocd-rw=""/>
                <register caption="SPI Status Register" name="SPSR0" offset="0x4D" size="1" ocd-rw="R">
                    <bitfield caption="SPI Interrupt Flag" mask="0x80" name="SPIF0"/>
                    <bitfield caption="Write Collision Flag" mask="0x40" name="WCOL0"/>
                    <bitfield caption="Double SPI Speed Bit" mask="0x01" name="SPI2X0"/>
                </register>
                <register caption="SPI Control Register" name="SPCR0" offset="0x4C" size="1">
                    <bitfield caption="SPI Interrupt Enable" mask="0x80" name="SPIE0"/>
                    <bitfield caption="SPI Enable" mask="0x40" name="SPE0"/>
                    <bitfield caption="Data Order" mask="0x20" name="DORD0"/>
                    <bitfield caption="Master/Slave Select" mask="0x10" name="MSTR0"/>
                    <bitfield caption="Clock polarity" mask="0x08" name="CPOL0"/>
                    <bitfield caption="Clock Phase" mask="0x04" name="CPHA0"/>
                    <bitfield caption="SPI Clock Rate Select 1" mask="0x02" name="SPR10"/>
                    <bitfield caption="SPI Clock Rate Select 0" mask="0x01" name="SPR00" values="COMM_SCK_RATE_3BIT"/>
                </register>
            </register-group>
            <value-group caption="" name="COMM_SCK_RATE_3BIT">
                <value caption="fosc/4" name="VAL_0x00" value="0x00"/>
                <value caption="fosc/16" name="VAL_0x01" value="0x01"/>
                <value caption="fosc/64" name="VAL_0x02" value="0x02"/>
                <value caption="fosc/128" name="VAL_0x03" value="0x03"/>
                <value caption="fosc/2" name="VAL_0x04" value="0x04"/>
                <value caption="fosc/8" name="VAL_0x05" value="0x05"/>
                <value caption="fosc/32" name="VAL_0x06" value="0x06"/>
                <value caption="fosc/64" name="VAL_0x07" value="0x07"/>
            </value-group>
        </module>
        <module caption="Two Wire Serial Interface" name="TWI">
            <register-group caption="Two Wire Serial Interface" name="TWI">
                <register caption="TWI (Slave) Address Mask Register" name="TWAMR" offset="0xBD" size="1">
                    <bitfield caption="" mask="0xFE" name="TWAM"/>
                </register>
                <register caption="TWI Bit Rate register" name="TWBR" offset="0xB8" size="1" mask="0xFF"/>
                <register caption="TWI Control Register" name="TWCR" offset="0xBC" size="1" ocd-rw="R">
                    <bitfield caption="TWI Interrupt Flag" mask="0x80" name="TWINT"/>
                    <bitfield caption="TWI Enable Acknowledge Bit" mask="0x40" name="TWEA"/>
                    <bitfield caption="TWI Start Condition Bit" mask="0x20" name="TWSTA"/>
                    <bitfield caption="TWI Stop Condition Bit" mask="0x10" name="TWSTO"/>
                    <bitfield caption="TWI Write Collition Flag" mask="0x08" name="TWWC"/>
                    <bitfield caption="TWI Enable Bit" mask="0x04" name="TWEN"/>
                    <bitfield caption="TWI Interrupt Enable" mask="0x01" name="TWIE"/>
                </register>
                <register caption="TWI Status Register" name="TWSR" offset="0xB9" size="1">
                    <bitfield caption="TWI Status" mask="0xF8" name="TWS" lsb="3"/>
                    <bitfield caption="TWI Prescaler" mask="0x03" name="TWPS" values="COMM_TWI_PRESACLE"/>
                </register>
                <register caption="TWI Data register" name="TWDR" offset="0xBB" size="1" mask="0xFF"/>
                <register caption="TWI (Slave) Address register" name="TWAR" offset="0xBA" size="1">
                    <bitfield caption="TWI (Slave) Address register Bits" mask="0xFE" name="TWA"/>
                    <bitfield caption="TWI General Call Recognition Enable Bit" mask="0x01" name="TWGCE"/>
                </register>
            </register-group>
            <value-group caption="" name="COMM_TWI_PRESACLE">
                <value caption="1" name="VAL_0x00" value="0x00"/>
                <value caption="4" name="VAL_0x01" value="0x01"/>
                <value caption="16" name="VAL_0x02" value="0x02"/>
                <value caption="64" name="VAL_0x03" value="0x03"/>
            </value-group>
        </module>
        <module caption="CPU Registers" name="CPU">
            <register-group caption="CPU Registers" name="CPU">
                <register caption="Status Register" name="SREG" offset="0x5F" size="1">
                    <bitfield caption="Global Interrupt Enable" mask="0x80" name="I"/>
                    <bitfield caption="Bit Copy Storage" mask="0x40" name="T"/>
                    <bitfield caption="Half Carry Flag" mask="0x20" name="H"/>
                    <bitfield caption="Sign Bit" mask="0x10" name="S"/>
                    <bitfield caption="Two's Complement Overflow Flag" mask="0x08" name="V"/>
                    <bitfield caption="Negative Flag" mask="0x04" name="N"/>
                    <bitfield caption="Zero Flag" mask="0x02" name="Z"/>
                    <bitfield caption="Carry Flag" mask="0x01" name="C"/>
                </register>
                <register caption="Stack Pointer " name="SP" offset="0x5D" size="2" mask="0x1FFF"/>
                <register caption="MCU Control Register" name="MCUCR" offset="0x55" size="1">
                    <bitfield caption="JTAG Interface Disable" mask="0x80" name="JTD"/>
                    <bitfield caption="BOD Power Down in Sleep" mask="0x40" name="BODS"/>
                    <bitfield caption="BOD Power Down in Sleep Enable" mask="0x20" name="BODSE"/>
                    <bitfield caption="Pull-up disable" mask="0x10" name="PUD"/>
                    <bitfield caption="Interrupt Vector Select" mask="0x02" name="IVSEL"/>
                    <bitfield caption="Interrupt Vector Change Enable" mask="0x01" name="IVCE"/>
                </register>
